#include "stdio.h"

void main()
{
	int i, n, number;

	printf("Please input a number: ");
	scanf("%d", &n);

    number = n;
    printf("%d = ", n);

	//for循环用于将所有质因素值都求出来
	for (i=2; i<=n; i++) {
        //while循环用于将值为i的质因素全部求出来
		while (n != i) {
			if (n % i == 0) {
			    printf("%d * ", i);
				n = n / i;
			} else {
			    break;
			}
		}
	}

    --i;
	//该处判断是否为质素，质素的表示方法与其他数不同
	if (i == number) {
	    printf("1 * %d\n", n);
	} else {
	    printf("%d\n", n);
	}
}

/*
总结：
    这里的关键在于，分解质因素的过程，通常按照我们的意识，简单的可以根据潜意识直接分解，或是直接拿质因素去分解它，
	但是这样的话，计算机又要去分辨质数，比较麻烦。可以利用计算机速度快的特点，让他讲一部分函数都计算一遍，
	再在里面得到我们需要的结果。

	其实质因素的分解，过程为：
	    从2 开始，一直整除2到不能整除2 为止，求出所有的值为2的因数。其实之后该值就不能被
	        其他的偶素整除了。
	    然后看除剩下的值是不是3，不是的话，继续一直整除3到不能整除为止。
		    不断循环下去，一直到除到它自己除自己。
*/