/*
题目：两个乒乓球队进行比赛，各出三人。甲队为 a,b,c 三人，乙队为 x,y,z 三人。已抽签决定比赛名单。
      有人向队员打听比赛的名单。a 说他不和 x 比，c 说他不和 x,z 比，请编程序找出三队赛手的名单。
*/

/*
分析：属于两个对象里面的内容相互匹配的问题，通常的思路就是，先不管什么条件，先用for嵌套，将所有的
      排列情况都实现，最后在利用 if条件语句，将满足我们要求的内容选出来。
*/

#include "stdio.h"

void main()
{
	int i, j, k;  //设a, b, c 的对手是i, j, k

	for (i = 'x'; i <= 'z'; i++) {
		for (j = 'x'; j <= 'z'; j++) {
			//三次嵌套时，可以在第二个后面加条件判断，避免不满足条件时进入第三次循环，减少无用操作，提高代码效率。
			//虽然该判断可以放在第三个for循环内部，但是将他放第二个循环后面，
			//避免不满足条件时进入第三次循环，减少无用操作，提高代码效率。
			if (i != j) {
				for (k = 'x'; k <= 'z'; k++) {
					if (i != k && j != k) {    //隐性条件
						if (i != 'x' && k != 'x' && k!= 'z') {   //题目明显的条件要求
							printf("a-->%c  b-->%c  c-->%c\n", i, j, k);
						}
					}
				}
			}
		}
	}
}